###################################################################

# Created by write_sdc on Wed Dec  7 16:17:36 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_load -pin_load 1 [get_ports DataMem_Read]
set_load -pin_load 1 [get_ports {DataMem_Write[3]}]
set_load -pin_load 1 [get_ports {DataMem_Write[2]}]
set_load -pin_load 1 [get_ports {DataMem_Write[1]}]
set_load -pin_load 1 [get_ports {DataMem_Write[0]}]
set_load -pin_load 1 [get_ports {DataMem_Address[29]}]
set_load -pin_load 1 [get_ports {DataMem_Address[28]}]
set_load -pin_load 1 [get_ports {DataMem_Address[27]}]
set_load -pin_load 1 [get_ports {DataMem_Address[26]}]
set_load -pin_load 1 [get_ports {DataMem_Address[25]}]
set_load -pin_load 1 [get_ports {DataMem_Address[24]}]
set_load -pin_load 1 [get_ports {DataMem_Address[23]}]
set_load -pin_load 1 [get_ports {DataMem_Address[22]}]
set_load -pin_load 1 [get_ports {DataMem_Address[21]}]
set_load -pin_load 1 [get_ports {DataMem_Address[20]}]
set_load -pin_load 1 [get_ports {DataMem_Address[19]}]
set_load -pin_load 1 [get_ports {DataMem_Address[18]}]
set_load -pin_load 1 [get_ports {DataMem_Address[17]}]
set_load -pin_load 1 [get_ports {DataMem_Address[16]}]
set_load -pin_load 1 [get_ports {DataMem_Address[15]}]
set_load -pin_load 1 [get_ports {DataMem_Address[14]}]
set_load -pin_load 1 [get_ports {DataMem_Address[13]}]
set_load -pin_load 1 [get_ports {DataMem_Address[12]}]
set_load -pin_load 1 [get_ports {DataMem_Address[11]}]
set_load -pin_load 1 [get_ports {DataMem_Address[10]}]
set_load -pin_load 1 [get_ports {DataMem_Address[9]}]
set_load -pin_load 1 [get_ports {DataMem_Address[8]}]
set_load -pin_load 1 [get_ports {DataMem_Address[7]}]
set_load -pin_load 1 [get_ports {DataMem_Address[6]}]
set_load -pin_load 1 [get_ports {DataMem_Address[5]}]
set_load -pin_load 1 [get_ports {DataMem_Address[4]}]
set_load -pin_load 1 [get_ports {DataMem_Address[3]}]
set_load -pin_load 1 [get_ports {DataMem_Address[2]}]
set_load -pin_load 1 [get_ports {DataMem_Address[1]}]
set_load -pin_load 1 [get_ports {DataMem_Address[0]}]
set_load -pin_load 1 [get_ports {DataMem_Out[31]}]
set_load -pin_load 1 [get_ports {DataMem_Out[30]}]
set_load -pin_load 1 [get_ports {DataMem_Out[29]}]
set_load -pin_load 1 [get_ports {DataMem_Out[28]}]
set_load -pin_load 1 [get_ports {DataMem_Out[27]}]
set_load -pin_load 1 [get_ports {DataMem_Out[26]}]
set_load -pin_load 1 [get_ports {DataMem_Out[25]}]
set_load -pin_load 1 [get_ports {DataMem_Out[24]}]
set_load -pin_load 1 [get_ports {DataMem_Out[23]}]
set_load -pin_load 1 [get_ports {DataMem_Out[22]}]
set_load -pin_load 1 [get_ports {DataMem_Out[21]}]
set_load -pin_load 1 [get_ports {DataMem_Out[20]}]
set_load -pin_load 1 [get_ports {DataMem_Out[19]}]
set_load -pin_load 1 [get_ports {DataMem_Out[18]}]
set_load -pin_load 1 [get_ports {DataMem_Out[17]}]
set_load -pin_load 1 [get_ports {DataMem_Out[16]}]
set_load -pin_load 1 [get_ports {DataMem_Out[15]}]
set_load -pin_load 1 [get_ports {DataMem_Out[14]}]
set_load -pin_load 1 [get_ports {DataMem_Out[13]}]
set_load -pin_load 1 [get_ports {DataMem_Out[12]}]
set_load -pin_load 1 [get_ports {DataMem_Out[11]}]
set_load -pin_load 1 [get_ports {DataMem_Out[10]}]
set_load -pin_load 1 [get_ports {DataMem_Out[9]}]
set_load -pin_load 1 [get_ports {DataMem_Out[8]}]
set_load -pin_load 1 [get_ports {DataMem_Out[7]}]
set_load -pin_load 1 [get_ports {DataMem_Out[6]}]
set_load -pin_load 1 [get_ports {DataMem_Out[5]}]
set_load -pin_load 1 [get_ports {DataMem_Out[4]}]
set_load -pin_load 1 [get_ports {DataMem_Out[3]}]
set_load -pin_load 1 [get_ports {DataMem_Out[2]}]
set_load -pin_load 1 [get_ports {DataMem_Out[1]}]
set_load -pin_load 1 [get_ports {DataMem_Out[0]}]
set_load -pin_load 1 [get_ports {InstMem_Address[29]}]
set_load -pin_load 1 [get_ports {InstMem_Address[28]}]
set_load -pin_load 1 [get_ports {InstMem_Address[27]}]
set_load -pin_load 1 [get_ports {InstMem_Address[26]}]
set_load -pin_load 1 [get_ports {InstMem_Address[25]}]
set_load -pin_load 1 [get_ports {InstMem_Address[24]}]
set_load -pin_load 1 [get_ports {InstMem_Address[23]}]
set_load -pin_load 1 [get_ports {InstMem_Address[22]}]
set_load -pin_load 1 [get_ports {InstMem_Address[21]}]
set_load -pin_load 1 [get_ports {InstMem_Address[20]}]
set_load -pin_load 1 [get_ports {InstMem_Address[19]}]
set_load -pin_load 1 [get_ports {InstMem_Address[18]}]
set_load -pin_load 1 [get_ports {InstMem_Address[17]}]
set_load -pin_load 1 [get_ports {InstMem_Address[16]}]
set_load -pin_load 1 [get_ports {InstMem_Address[15]}]
set_load -pin_load 1 [get_ports {InstMem_Address[14]}]
set_load -pin_load 1 [get_ports {InstMem_Address[13]}]
set_load -pin_load 1 [get_ports {InstMem_Address[12]}]
set_load -pin_load 1 [get_ports {InstMem_Address[11]}]
set_load -pin_load 1 [get_ports {InstMem_Address[10]}]
set_load -pin_load 1 [get_ports {InstMem_Address[9]}]
set_load -pin_load 1 [get_ports {InstMem_Address[8]}]
set_load -pin_load 1 [get_ports {InstMem_Address[7]}]
set_load -pin_load 1 [get_ports {InstMem_Address[6]}]
set_load -pin_load 1 [get_ports {InstMem_Address[5]}]
set_load -pin_load 1 [get_ports {InstMem_Address[4]}]
set_load -pin_load 1 [get_ports {InstMem_Address[3]}]
set_load -pin_load 1 [get_ports {InstMem_Address[2]}]
set_load -pin_load 1 [get_ports {InstMem_Address[1]}]
set_load -pin_load 1 [get_ports {InstMem_Address[0]}]
set_load -pin_load 1 [get_ports InstMem_Read]
set_load -pin_load 1 [get_ports {IP[7]}]
set_load -pin_load 1 [get_ports {IP[6]}]
set_load -pin_load 1 [get_ports {IP[5]}]
set_load -pin_load 1 [get_ports {IP[4]}]
set_load -pin_load 1 [get_ports {IP[3]}]
set_load -pin_load 1 [get_ports {IP[2]}]
set_load -pin_load 1 [get_ports {IP[1]}]
set_load -pin_load 1 [get_ports {IP[0]}]
set_max_fanout 20 [get_ports clock]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports {Interrupts[4]}]
set_max_fanout 20 [get_ports {Interrupts[3]}]
set_max_fanout 20 [get_ports {Interrupts[2]}]
set_max_fanout 20 [get_ports {Interrupts[1]}]
set_max_fanout 20 [get_ports {Interrupts[0]}]
set_max_fanout 20 [get_ports NMI]
set_max_fanout 20 [get_ports {DataMem_In[31]}]
set_max_fanout 20 [get_ports {DataMem_In[30]}]
set_max_fanout 20 [get_ports {DataMem_In[29]}]
set_max_fanout 20 [get_ports {DataMem_In[28]}]
set_max_fanout 20 [get_ports {DataMem_In[27]}]
set_max_fanout 20 [get_ports {DataMem_In[26]}]
set_max_fanout 20 [get_ports {DataMem_In[25]}]
set_max_fanout 20 [get_ports {DataMem_In[24]}]
set_max_fanout 20 [get_ports {DataMem_In[23]}]
set_max_fanout 20 [get_ports {DataMem_In[22]}]
set_max_fanout 20 [get_ports {DataMem_In[21]}]
set_max_fanout 20 [get_ports {DataMem_In[20]}]
set_max_fanout 20 [get_ports {DataMem_In[19]}]
set_max_fanout 20 [get_ports {DataMem_In[18]}]
set_max_fanout 20 [get_ports {DataMem_In[17]}]
set_max_fanout 20 [get_ports {DataMem_In[16]}]
set_max_fanout 20 [get_ports {DataMem_In[15]}]
set_max_fanout 20 [get_ports {DataMem_In[14]}]
set_max_fanout 20 [get_ports {DataMem_In[13]}]
set_max_fanout 20 [get_ports {DataMem_In[12]}]
set_max_fanout 20 [get_ports {DataMem_In[11]}]
set_max_fanout 20 [get_ports {DataMem_In[10]}]
set_max_fanout 20 [get_ports {DataMem_In[9]}]
set_max_fanout 20 [get_ports {DataMem_In[8]}]
set_max_fanout 20 [get_ports {DataMem_In[7]}]
set_max_fanout 20 [get_ports {DataMem_In[6]}]
set_max_fanout 20 [get_ports {DataMem_In[5]}]
set_max_fanout 20 [get_ports {DataMem_In[4]}]
set_max_fanout 20 [get_ports {DataMem_In[3]}]
set_max_fanout 20 [get_ports {DataMem_In[2]}]
set_max_fanout 20 [get_ports {DataMem_In[1]}]
set_max_fanout 20 [get_ports {DataMem_In[0]}]
set_max_fanout 20 [get_ports DataMem_Ready]
set_max_fanout 20 [get_ports {InstMem_In[31]}]
set_max_fanout 20 [get_ports {InstMem_In[30]}]
set_max_fanout 20 [get_ports {InstMem_In[29]}]
set_max_fanout 20 [get_ports {InstMem_In[28]}]
set_max_fanout 20 [get_ports {InstMem_In[27]}]
set_max_fanout 20 [get_ports {InstMem_In[26]}]
set_max_fanout 20 [get_ports {InstMem_In[25]}]
set_max_fanout 20 [get_ports {InstMem_In[24]}]
set_max_fanout 20 [get_ports {InstMem_In[23]}]
set_max_fanout 20 [get_ports {InstMem_In[22]}]
set_max_fanout 20 [get_ports {InstMem_In[21]}]
set_max_fanout 20 [get_ports {InstMem_In[20]}]
set_max_fanout 20 [get_ports {InstMem_In[19]}]
set_max_fanout 20 [get_ports {InstMem_In[18]}]
set_max_fanout 20 [get_ports {InstMem_In[17]}]
set_max_fanout 20 [get_ports {InstMem_In[16]}]
set_max_fanout 20 [get_ports {InstMem_In[15]}]
set_max_fanout 20 [get_ports {InstMem_In[14]}]
set_max_fanout 20 [get_ports {InstMem_In[13]}]
set_max_fanout 20 [get_ports {InstMem_In[12]}]
set_max_fanout 20 [get_ports {InstMem_In[11]}]
set_max_fanout 20 [get_ports {InstMem_In[10]}]
set_max_fanout 20 [get_ports {InstMem_In[9]}]
set_max_fanout 20 [get_ports {InstMem_In[8]}]
set_max_fanout 20 [get_ports {InstMem_In[7]}]
set_max_fanout 20 [get_ports {InstMem_In[6]}]
set_max_fanout 20 [get_ports {InstMem_In[5]}]
set_max_fanout 20 [get_ports {InstMem_In[4]}]
set_max_fanout 20 [get_ports {InstMem_In[3]}]
set_max_fanout 20 [get_ports {InstMem_In[2]}]
set_max_fanout 20 [get_ports {InstMem_In[1]}]
set_max_fanout 20 [get_ports {InstMem_In[0]}]
set_max_fanout 20 [get_ports InstMem_Ready]
create_clock [get_ports clock]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clock]
set_clock_uncertainty 0.1  [get_clocks clock]
set_input_delay -clock clock  1  [get_ports reset]
set_input_delay -clock clock  1  [get_ports {Interrupts[4]}]
set_input_delay -clock clock  1  [get_ports {Interrupts[3]}]
set_input_delay -clock clock  1  [get_ports {Interrupts[2]}]
set_input_delay -clock clock  1  [get_ports {Interrupts[1]}]
set_input_delay -clock clock  1  [get_ports {Interrupts[0]}]
set_input_delay -clock clock  1  [get_ports NMI]
set_input_delay -clock clock  1  [get_ports {DataMem_In[31]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[30]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[29]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[28]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[27]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[26]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[25]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[24]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[23]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[22]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[21]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[20]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[19]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[18]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[17]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[16]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[15]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[14]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[13]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[12]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[11]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[10]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[9]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[8]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[7]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[6]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[5]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[4]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[3]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[2]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[1]}]
set_input_delay -clock clock  1  [get_ports {DataMem_In[0]}]
set_input_delay -clock clock  1  [get_ports DataMem_Ready]
set_input_delay -clock clock  1  [get_ports {InstMem_In[31]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[30]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[29]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[28]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[27]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[26]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[25]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[24]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[23]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[22]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[21]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[20]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[19]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[18]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[17]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[16]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[15]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[14]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[13]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[12]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[11]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[10]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[9]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[8]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[7]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[6]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[5]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[4]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[3]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[2]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[1]}]
set_input_delay -clock clock  1  [get_ports {InstMem_In[0]}]
set_input_delay -clock clock  1  [get_ports InstMem_Ready]
set_output_delay -clock clock  0.5  [get_ports DataMem_Read]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Write[3]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Write[2]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Write[1]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Write[0]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[29]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[28]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[27]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[26]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[25]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[24]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[23]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[22]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[21]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[20]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[19]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[18]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[17]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[16]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[15]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[14]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[13]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[12]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[11]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[10]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[9]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[8]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[7]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[6]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[5]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[4]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[3]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[2]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[1]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Address[0]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[31]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[30]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[29]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[28]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[27]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[26]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[25]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[24]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[23]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[22]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[21]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[20]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[19]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[18]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[17]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[16]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[15]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[14]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[13]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[12]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[11]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[10]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[9]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[8]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[7]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[6]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[5]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[4]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[3]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[2]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[1]}]
set_output_delay -clock clock  0.5  [get_ports {DataMem_Out[0]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[29]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[28]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[27]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[26]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[25]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[24]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[23]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[22]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[21]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[20]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[19]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[18]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[17]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[16]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[15]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[14]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[13]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[12]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[11]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[10]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[9]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[8]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[7]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[6]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[5]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[4]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[3]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[2]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[1]}]
set_output_delay -clock clock  0.5  [get_ports {InstMem_Address[0]}]
set_output_delay -clock clock  0.5  [get_ports InstMem_Read]
set_output_delay -clock clock  0.5  [get_ports {IP[7]}]
set_output_delay -clock clock  0.5  [get_ports {IP[6]}]
set_output_delay -clock clock  0.5  [get_ports {IP[5]}]
set_output_delay -clock clock  0.5  [get_ports {IP[4]}]
set_output_delay -clock clock  0.5  [get_ports {IP[3]}]
set_output_delay -clock clock  0.5  [get_ports {IP[2]}]
set_output_delay -clock clock  0.5  [get_ports {IP[1]}]
set_output_delay -clock clock  0.5  [get_ports {IP[0]}]
set_drive 1  [get_ports clock]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports {Interrupts[4]}]
set_drive 1  [get_ports {Interrupts[3]}]
set_drive 1  [get_ports {Interrupts[2]}]
set_drive 1  [get_ports {Interrupts[1]}]
set_drive 1  [get_ports {Interrupts[0]}]
set_drive 1  [get_ports NMI]
set_drive 1  [get_ports {DataMem_In[31]}]
set_drive 1  [get_ports {DataMem_In[30]}]
set_drive 1  [get_ports {DataMem_In[29]}]
set_drive 1  [get_ports {DataMem_In[28]}]
set_drive 1  [get_ports {DataMem_In[27]}]
set_drive 1  [get_ports {DataMem_In[26]}]
set_drive 1  [get_ports {DataMem_In[25]}]
set_drive 1  [get_ports {DataMem_In[24]}]
set_drive 1  [get_ports {DataMem_In[23]}]
set_drive 1  [get_ports {DataMem_In[22]}]
set_drive 1  [get_ports {DataMem_In[21]}]
set_drive 1  [get_ports {DataMem_In[20]}]
set_drive 1  [get_ports {DataMem_In[19]}]
set_drive 1  [get_ports {DataMem_In[18]}]
set_drive 1  [get_ports {DataMem_In[17]}]
set_drive 1  [get_ports {DataMem_In[16]}]
set_drive 1  [get_ports {DataMem_In[15]}]
set_drive 1  [get_ports {DataMem_In[14]}]
set_drive 1  [get_ports {DataMem_In[13]}]
set_drive 1  [get_ports {DataMem_In[12]}]
set_drive 1  [get_ports {DataMem_In[11]}]
set_drive 1  [get_ports {DataMem_In[10]}]
set_drive 1  [get_ports {DataMem_In[9]}]
set_drive 1  [get_ports {DataMem_In[8]}]
set_drive 1  [get_ports {DataMem_In[7]}]
set_drive 1  [get_ports {DataMem_In[6]}]
set_drive 1  [get_ports {DataMem_In[5]}]
set_drive 1  [get_ports {DataMem_In[4]}]
set_drive 1  [get_ports {DataMem_In[3]}]
set_drive 1  [get_ports {DataMem_In[2]}]
set_drive 1  [get_ports {DataMem_In[1]}]
set_drive 1  [get_ports {DataMem_In[0]}]
set_drive 1  [get_ports DataMem_Ready]
set_drive 1  [get_ports {InstMem_In[31]}]
set_drive 1  [get_ports {InstMem_In[30]}]
set_drive 1  [get_ports {InstMem_In[29]}]
set_drive 1  [get_ports {InstMem_In[28]}]
set_drive 1  [get_ports {InstMem_In[27]}]
set_drive 1  [get_ports {InstMem_In[26]}]
set_drive 1  [get_ports {InstMem_In[25]}]
set_drive 1  [get_ports {InstMem_In[24]}]
set_drive 1  [get_ports {InstMem_In[23]}]
set_drive 1  [get_ports {InstMem_In[22]}]
set_drive 1  [get_ports {InstMem_In[21]}]
set_drive 1  [get_ports {InstMem_In[20]}]
set_drive 1  [get_ports {InstMem_In[19]}]
set_drive 1  [get_ports {InstMem_In[18]}]
set_drive 1  [get_ports {InstMem_In[17]}]
set_drive 1  [get_ports {InstMem_In[16]}]
set_drive 1  [get_ports {InstMem_In[15]}]
set_drive 1  [get_ports {InstMem_In[14]}]
set_drive 1  [get_ports {InstMem_In[13]}]
set_drive 1  [get_ports {InstMem_In[12]}]
set_drive 1  [get_ports {InstMem_In[11]}]
set_drive 1  [get_ports {InstMem_In[10]}]
set_drive 1  [get_ports {InstMem_In[9]}]
set_drive 1  [get_ports {InstMem_In[8]}]
set_drive 1  [get_ports {InstMem_In[7]}]
set_drive 1  [get_ports {InstMem_In[6]}]
set_drive 1  [get_ports {InstMem_In[5]}]
set_drive 1  [get_ports {InstMem_In[4]}]
set_drive 1  [get_ports {InstMem_In[3]}]
set_drive 1  [get_ports {InstMem_In[2]}]
set_drive 1  [get_ports {InstMem_In[1]}]
set_drive 1  [get_ports {InstMem_In[0]}]
set_drive 1  [get_ports InstMem_Ready]
